Tekla Open API Reference for Tekla Structures 2025
BaseWeld.AdditionalSizeBelow Property
 Gets or sets the additional size below for combination welds.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double AdditionalSizeBelow { get; set; }
Public Property AdditionalSizeBelow As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace